Tekla Open API Reference for Tekla Structures 2025
ComponentOptions.PartWeldedToPrimaryStartNumber Property
The part welded to primary start number.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int PartWeldedToPrimaryStartNumber { get; set; }
Public Property PartWeldedToPrimaryStartNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace